In [2]:
data = {
    "Name": ["Laxman", "Susan", "Pratik"],
    "Salary": [50000, 60000, 55000]
}
df = pd.DataFrame(data)

df.to_csv("datas.csv", index=False)

print("DataFrame saved to output.csv without index.")

DataFrame saved to output.csv without index.

In [3]:
#by index
print(df.iloc[1])

Name      Susan
Salary    60000
Name: 1, dtype: object

In [14]:
#by index position
print(df.loc[l])  # Access the first row

NameError: name 'l' is not defined

In [5]:
#saving data to a csv file
import numpy as np
import pandas as pd

df.to_csv('datas.csv', index=False)

In [7]:
#read data from csv file
df_new = pd.read_csv('datas.csv')
print(df_new)

     Name  Salary
0  Laxman   50000
1   Susan   60000
2  Pratik   55000

In [8]:
#save to excel file
df.to_excel('datas.xlsx', index=False)

In [21]:
#data cleaning and transformation
data = {
    "Name": ["Dipesh", "Susan", "Hari", "Pratik"],
    "Department": ["HR", "CS", "IT", "Finance"],
    "Salary": [50000, None, 55000, 60000],
    "Age": [25, 30, 22, 25]
}
df = pd.DataFrame(data)

In [22]:
df

     Name Department   Salary  Age
0  Dipesh         HR  50000.0   25
1   Susan         CS      NaN   30
2    Hari         IT  55000.0   22
3  Pratik    Finance  60000.0   25

In [23]:
#Handle missing values
print(df.isnull().sum())
df["Salary"].fillna(df["Salary"].mean(), inplace=True)

Name          0
Department    0
Salary        1
Age           0
dtype: int64

C:\Users\user\AppData\Local\Temp\ipykernel_22600\1176443752.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Salary"].fillna(df["Salary"].mean(), inplace=True)

In [25]:
df

     Name Department   Salary  Age
0  Dipesh         HR  50000.0   25
1   Susan         CS  55000.0   30
2    Hari         IT  55000.0   22
3  Pratik    Finance  60000.0   25

In [27]:
#add a new column
df["Bonus"] = df["Salary"] * 0.1

In [28]:
df

     Name Department   Salary  Age   Bonus
0  Dipesh         HR  50000.0   25  5000.0
1   Susan         CS  55000.0   30  5500.0
2    Hari         IT  55000.0   22  5500.0
3  Pratik    Finance  60000.0   25  6000.0

In [29]:
#groupby
print(df.groupby("Department")["Salary"].mean())

Department
CS         55000.0
Finance    60000.0
HR         50000.0
IT         55000.0
Name: Salary, dtype: float64

In [34]:
print(df.groupby("Department")["Bonus"].count())

Department
CS         1
Finance    1
HR         1
IT         1
Name: Bonus, dtype: int64

In [31]:
#sorting
print(df.sort_values("Salary", ascending=False))

     Name Department   Salary  Age   Bonus
3  Pratik    Finance  60000.0   25  6000.0
1   Susan         CS  55000.0   30  5500.0
2    Hari         IT  55000.0   22  5500.0
0  Dipesh         HR  50000.0   25  5000.0

In [39]:
#merging dataframes
employee =pd.DataFrame({
    "Emp_ID": [101, 102, 103],
    "Name": ["Dipesh", "Susan", "Hari"]
})

salary = pd.DataFrame({
    "Emp_ID": [101, 102, 103],
    "Salary": [50000, 60000, 55000]
})

merged_df = pd.merge(employee, salary, on="Emp_ID")
print(merged_df)

   Emp_ID    Name  Salary
0     101  Dipesh   50000
1     102   Susan   60000
2     103    Hari   55000

In [41]:

#merge
emp={
    "E_id": [101, 102, 103, 104],
    "Name": ["Dipesh", "Susan", "Hari", "Pratik"]
}
sal = pd.DataFrame({
    "E_id": [101, 102, 103],    
    "Salary": [50000, 60000, 55000]
})
emp_df = pd.DataFrame(emp)
merged_df = pd.merge(emp_df, sal, on="E_id", how="left")
print(merged_df)

   E_id    Name   Salary
0   101  Dipesh  50000.0
1   102   Susan  60000.0
2   103    Hari  55000.0
3   104  Pratik      NaN

In [ ]:
#select two columns
print(df[["Name", "Salary"]])

In [ ]:
#filtering data from students with age greater than 20
print(df[df["Age"] > 25])

In [42]:
#sorting
print(df.sort_values("Salary", ascending=False))

     Name Department   Salary  Age   Bonus
3  Pratik    Finance  60000.0   25  6000.0
1   Susan         CS  55000.0   30  5500.0
2    Hari         IT  55000.0   22  5500.0
0  Dipesh         HR  50000.0   25  5000.0

In [43]:
print(df.sort_values("Age"))

     Name Department   Salary  Age   Bonus
2    Hari         IT  55000.0   22  5500.0
0  Dipesh         HR  50000.0   25  5000.0
3  Pratik    Finance  60000.0   25  6000.0
1   Susan         CS  55000.0   30  5500.0

In [44]:
#adding a column
df["Experience"] = [2, 5, 1, 3]
print(df)

     Name Department   Salary  Age   Bonus  Experience
0  Dipesh         HR  50000.0   25  5000.0           2
1   Susan         CS  55000.0   30  5500.0           5
2    Hari         IT  55000.0   22  5500.0           1
3  Pratik    Finance  60000.0   25  6000.0           3

In [ ]:
df["Experience_Level"] = np.where(df["Experience"] > 2, "Senior", "Junior")
print(df)

     Name Department   Salary  Age   Bonus  Experience Experience_Level
0  Dipesh         HR  50000.0   25  5000.0           2           Junior
1   Susan         CS  55000.0   30  5500.0           5           Senior
2    Hari         IT  55000.0   22  5500.0           1           Junior
3  Pratik    Finance  60000.0   25  6000.0           3           Senior

create a dataframe (employee_name, age, salary)

In [49]:
emp_df = pd.DataFrame({
    "Emp_Name": ["Dipesh", "Susan", "Hari", "Pratik"],
    "Salary": [50000, None, 85000, 100000],
    "Age": [25, 30, 22, None]
})

print(emp_df)

  Emp_Name    Salary   Age
0   Dipesh   50000.0  25.0
1    Susan       NaN  30.0
2     Hari   85000.0  22.0
3   Pratik  100000.0   NaN

show first 2 rows, name and age

In [ ]:
emp_df["Grade"] = np.where(emp_df["Salary"] > 55000, "A", "B")
print(emp_df)

  Emp_Name    Salary   Age Grade
0   Dipesh   50000.0  25.0     B
1    Susan       NaN  30.0     B
2     Hari   85000.0  22.0     A
3   Pratik  100000.0   NaN     A

add grade column

In [51]:
print(emp_df.sort_values("Salary", ascending=False))

  Emp_Name    Salary   Age Grade
3   Pratik  100000.0   NaN     A
2     Hari   85000.0  22.0     A
0   Dipesh   50000.0  25.0     B
1    Susan       NaN  30.0     B

find the average of age

In [52]:
print(emp_df["Age"].mean())

25.666666666666668

select row where salary > 80000

In [53]:
print(emp_df[emp_df["Salary"] > 80000])

  Emp_Name    Salary   Age Grade
2     Hari   85000.0  22.0     A
3   Pratik  100000.0   NaN     A

find the youngest age

In [54]:
print(emp_df["Age"].min())

22.0

fill missing age with mean

In [56]:
emp_df["Age"].fillna(emp_df["Age"].mean())
print(emp_df)

  Emp_Name    Salary        Age Grade
0   Dipesh   50000.0  25.000000     B
1    Susan       NaN  30.000000     B
2     Hari   85000.0  22.000000     A
3   Pratik  100000.0  25.666667     A

fill missing salary with 0

In [ ]:
emp_df["Salary"].fillna(0, inplace=True)
print(emp_df)

  Emp_Name    Salary        Age Grade
0   Dipesh   50000.0  25.000000     B
1    Susan       0.0  30.000000     B
2     Hari   85000.0  22.000000     A
3   Pratik  100000.0  25.666667     A

C:\Users\user\AppData\Local\Temp\ipykernel_22600\3429225771.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  emp_df["Salary"].fillna(0, inplace=True)

write it to the csv.

In [59]:
emp_df.to_csv("employee_data.csv", index=False)

In [60]:

emp_data = pd.read_csv("employee_data.csv")
print(emp_data)

  Emp_Name    Salary        Age Grade
0   Dipesh   50000.0  25.000000     B
1    Susan       0.0  30.000000     B
2     Hari   85000.0  22.000000     A
3   Pratik  100000.0  25.666667     A